docs: overhaul README to be interactive and add live demo link
